{
  "_name_or_path": "cl-tohoku/bert-base-japanese-v3",
  "architectures": [
    "BertWithCrfForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-d_general",
    "2": "I-d_general",
    "3": "B-d_negative",
    "4": "I-d_negative",
    "5": "B-d_positive",
    "6": "I-d_positive",
    "7": "B-d_suspicious",
    "8": "I-d_suspicious",
    "9": "B-m-key_executed",
    "10": "I-m-key_executed",
    "11": "B-m-key_negated",
    "12": "I-m-key_negated",
    "13": "B-m-key_other",
    "14": "I-m-key_other",
    "15": "B-m-key_scheduled",
    "16": "I-m-key_scheduled"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-d_general": 1,
    "B-d_negative": 3,
    "B-d_positive": 5,
    "B-d_suspicious": 7,
    "B-m-key_executed": 9,
    "B-m-key_negated": 11,
    "B-m-key_other": 13,
    "B-m-key_scheduled": 15,
    "I-d_general": 2,
    "I-d_negative": 4,
    "I-d_positive": 6,
    "I-d_suspicious": 8,
    "I-m-key_executed": 10,
    "I-m-key_negated": 12,
    "I-m-key_other": 14,
    "I-m-key_scheduled": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32768
}
